
## Plan Result (terraform/cloudflare/b0xp.io/prometheus-operator)

[CI link](https://github.com/boxp/arch/actions/runs/8669706111)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_access_application.grafana
  * cloudflare_access_policy.grafana_policy
  * cloudflare_record.grafana
  * cloudflare_tunnel.prometheus_operator_tunnel


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_access_application.grafana will be created
  + resource "cloudflare_access_application" "grafana" {
      + account_id                = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "grafana.b0xp.io"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Access application for grafana.b0xp.io"
      + service_auth_401_redirect = false
      + session_duration          = "1h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.grafana_policy will be created
  + resource "cloudflare_access_policy" "grafana_policy" {
      + account_id     = (known after apply)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for grafana.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + github {}
        }
    }

  # cloudflare_record.grafana will be created
  + resource "cloudflare_record" "grafana" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "grafana"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.prometheus_operator_tunnel will be created
  + resource "cloudflare_tunnel" "prometheus_operator_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare prometheus-operator tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/prometheus-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/174/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":174,"Program":"tfcmt","SHA1":"a1b96ab03b5c6647e2b901062574de3e388ea701","Target":"terraform/cloudflare/b0xp.io/prometheus-operator","Vars":{},"WorkflowName":"pull_request_target"} -->